Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMC20_DFP/3.2.44/samc20/edc/ATSAMC20J18AU.PIC
      <edc:SFRDef edc:_addr="0x40001013" edc:access="-------n" edc:cname="EVCTRL" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="CFDEO" edc:desc="Clock Failure Detector Event Output Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001014" edc:access="nn----n-" edc:cname="OSC48MCTRL" edc:impl="0xC2" edc:mclr="10000010" edc:nzwidth="0x8" edc:por="10000010" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Oscillator Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:desc="On Demand Control" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001015" edc:access="----nnnn" edc:cname="OSC48MDIV" edc:impl="0xF" edc:mclr="00001011" edc:nzwidth="0x8" edc:por="00001011" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="DIV" edc:desc="OSC48M Division Factor" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="48 MHz" edc:when="(field &amp; 0xF) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="24 MHz" edc:when="(field &amp; 0xF) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DIV3" edc:desc="16 MHz" edc:when="(field &amp; 0xF) == 2"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="12 MHz" edc:when="(field &amp; 0xF) == 3"/>
              <edc:SFRFieldSemantic edc:cname="DIV5" edc:desc="9.6 MHz" edc:when="(field &amp; 0xF) == 4"/>
              <edc:SFRFieldSemantic edc:cname="DIV6" edc:desc="8 MHz" edc:when="(field &amp; 0xF) == 5"/>
              <edc:SFRFieldSemantic edc:cname="DIV7" edc:desc="6.86 MHz" edc:when="(field &amp; 0xF) == 6"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="6 MHz" edc:when="(field &amp; 0xF) == 7"/>
              <edc:SFRFieldSemantic edc:cname="DIV9" edc:desc="5.33 MHz" edc:when="(field &amp; 0xF) == 8"/>
              <edc:SFRFieldSemantic edc:cname="DIV10" edc:desc="4.8 MHz" edc:when="(field &amp; 0xF) == 9"/>
              <edc:SFRFieldSemantic edc:cname="DIV11" edc:desc="4.36 MHz" edc:when="(field &amp; 0xF) == 10"/>
              <edc:SFRFieldSemantic edc:cname="DIV12" edc:desc="4 MHz" edc:when="(field &amp; 0xF) == 11"/>
              <edc:SFRFieldSemantic edc:cname="DIV13" edc:desc="3.69 MHz" edc:when="(field &amp; 0xF) == 12"/>
              <edc:SFRFieldSemantic edc:cname="DIV14" edc:desc="3.43 MHz" edc:when="(field &amp; 0xF) == 13"/>
              <edc:SFRFieldSemantic edc:cname="DIV15" edc:desc="3.2 MHz" edc:when="(field &amp; 0xF) == 14"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="3 MHz" edc:when="(field &amp; 0xF) == 15"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001016" edc:access="-----nnn" edc:cname="OSC48MSTUP" edc:impl="0x7" edc:mclr="00000111" edc:nzwidth="0x8" edc:por="00000111" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="STARTUP" edc:desc="Startup Time" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="CYCLE8" edc:desc="166 ns" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE16" edc:desc="333 ns" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE32" edc:desc="667 ns" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE64" edc:desc="1.333 us" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE128" edc:desc="2.667 us" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE256" edc:desc="5.333 us" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE512" edc:desc="10.667 us" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE1024" edc:desc="21.333 us" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40001017" edc:offset="0x1"/>
      <edc:SFRDef edc:_addr="0x40001018" edc:access="-----------------------------r--" edc:cname="OSC48MSYNCBUSY" edc:impl="0x4" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="OSC48MDIV" edc:desc="OSC48MDIV Synchronization Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000101C" edc:access="nn----n-" edc:cname="DPLLCTRLA" edc:impl="0xC2" edc:mclr="10000000" edc:nzwidth="0x8" edc:por="10000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:desc="On Demand" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
